#ifndef C_NEURO_NET_TRAINER_H
#define C_NEURO_NET_TRAINER_H

//****************************************************************************************************
//Класс обучения нейросети
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <vector>
#include <string>
#include "cmatrix.h"
#include "cvector.h"
#include "idatastream.h"
#include "cneuronet.h"

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Класс обучения нейросети
//****************************************************************************************************
class CNeuroNetTrainer
{
 friend class CConvolutionalNeuroNetTrainer;
 friend class CConvolutionalKernelTrainer;
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 protected:
  //-переменные-----------------------------------------------------------------------------------------
  std::shared_ptr<CNeuroNet> cNeuroNet_Ptr;//указатель на класс обучаемой нейросети

  std::vector<CMatrix> cMatrix_dW;//изменения весов
  std::vector<CVector> cVector_dB;//поправки к сдвигам
  std::vector<CVector> cVector_Delta;//ошибки слоёв
  CVector cVector_Error;//вектор ошибки  

  //вспомогательные матрицы и вектора
  std::vector<CMatrix> cMatrix_TmpW;
  std::vector<CMatrix> cMatrix_TmpDelta;
  std::vector<CMatrix> cMatrix_Tmp;
  std::vector<CVector> cVector_Tmp;  
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CNeuroNetTrainer(void);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CNeuroNetTrainer();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  void Connect(std::shared_ptr<CNeuroNet> cNeuroNet_Ptr_Set);//подключиться к нейросети
  virtual double Training(const std::vector<std::pair<CVector,CVector>> &image,double speed,double max_cost,size_t max_iteration);//обучить нейросеть
 protected:
  //-закрытые функции-----------------------------------------------------------------------------------  
  void InitDeltaWeighAndBias(void);//инициализация поправок к весам и смещениям
  void CreateOutputLayerDeltaAndCost(const CVector &cVector_Output,double &cost);//посчитать дельту последнего слоя и функцию стоимости
  void SetOutputDelta(const CVector &cVector_Delta_Set);//задать дельту последнего слоя
  void OneStep(void);//выполнить один проход обучения
  void CreateDeltaInputLayer(void);//вычислить дельту входного слоя
  void UpdateWeightAndBias(double k);//обновить веса и смещения
};

#endif
