#ifndef C_VECTOR_H
#define C_VECTOR_H

//****************************************************************************************************
//Класс векторов произвольной размерности
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************
class CVector;

//****************************************************************************************************
//прототипы функций
//****************************************************************************************************
CVector operator+(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "+"
CVector operator-(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "-"
double operator*(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "*" (скалярное произведение)
CVector operator^(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "^" (векторное произведение)
CVector operator*(const CVector& cVector_Left,const double &value_right);//оператор "*"
CVector operator*(const double &value_left,const CVector& cVector_Right);//оператор "*"
CVector operator/(const CVector& cVector_Left,const double &value_right);//оператор "/"

//****************************************************************************************************
//Класс векторов произвольной размерности
//****************************************************************************************************
class CVector
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
  size_t Size;//размерность вектора
  std::vector<double> Item;//массив компонентов вектора
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CVector(size_t size=1);
  //-конструктор копирования----------------------------------------------------------------------------
  CVector(const CVector &cVector);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CVector();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  size_t GetSize(void) const;//получить размер вектора
  void Normalize(void);//нормировка вектора
  double GetNorma(void) const;//получить норму вектора
  double GetElement(size_t index) const;//получить элемент вектора
  void SetElement(size_t index,double value);//задать элемент вектора
  void Set(double x);//задать одномерный вектор
  void Set(double x,double y);//задать двухмерный вектор
  void Set(double x,double y,double z);//задать трёхмерный вектор
  void Set(double x,double y,double z,double a);//задать четырёхмерный вектор
  void Zero(void);//обнулить вектор
  CVector& operator=(const CVector& cVector);//оператор "="
  friend CVector operator+(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "+"
  friend CVector operator-(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "-"
  friend double operator*(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "*" (скалярное произведение)
  friend CVector operator^(const CVector& cVector_Left,const CVector& cVector_Right);//оператор "^" (векторное произведение)
  friend CVector operator*(const CVector& cVector_Left,const double &value_right);//оператор "*"
  friend CVector operator*(const double &value_left,const CVector& cVector_Right);//оператор "*"
  friend CVector operator/(const CVector& cVector_Left,const double &value_right);//оператор "/"
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
};

#endif

 
